In [10]:
import pandas as pd
#df = pd.read_csv("stock_data.csv",sep=';',header=None, names=["ticker","eps","revenue","price","people"]) #header=1 or we can use skiprows=1
#df = pd.read_csv("stock_data.csv",sep=';',nrows=3) #rows that will read
#df = pd.read_csv("stock_data.csv",sep=';',na_values=["not available","n.a."])
df = pd.read_csv("stock_data.csv",sep=';',na_values={
    'eps': ["not available", "n.a."],
    'revenue': ["not available", "n.a.", -1],
    'people': ["not available", "n.a."]
})
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3     RIL    NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [12]:
#df.to_csv("new.csv",sep=';',index=False)
#df2 = pd.read_csv("new.csv",sep=';')
#df2

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3     RIL    NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [13]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [20]:
#df.to_csv("new.csv",sep=';',columns=['tickers','eps'],index=False)
df.to_csv("new.csv",sep=';',header=False)
df2 = pd.read_csv("new.csv",sep=';')
df2

   0 GOOGL  27.82   87.0   845     larry page
0  1   WMT   4.61  484.0    65            NaN
1  2  MSFT  -1.00   85.0    64     bill gates
2  3   RIL    NaN   50.0  1023  mukesh ambani
3  4  TATA   5.60    NaN  n.a.     ratan tata